# File generated from our OpenAPI spec by Stainless. See CONTRIBUTING.md for details.

from __future__ import annotations

from typing_extensions import Literal, Required, TypedDict

from .._types import SequenceNotStr

__all__ = ["ToolSuggestParams"]


class ToolSuggestParams(TypedDict, total=False):
    list: Required[SequenceNotStr[str]]
    """Список исходных ключевых слов"""

    region: Required[
        Literal[
            1,
            2,
            4,
            5,
            7,
            8,
            9,
            10,
            11,
            12,
            13,
            14,
            15,
            16,
            20,
            21,
            22,
            23,
            24,
            25,
            28,
            30,
            33,
            35,
            36,
            37,
            38,
            39,
            41,
            42,
            43,
            45,
            47,
            48,
            49,
            50,
            51,
            53,
            54,
            56,
            62,
            63,
            64,
            65,
            66,
            67,
            75,
            76,
            77,
            149,
            159,
            172,
            187,
            191,
            192,
            193,
            195,
            197,
            213,
            225,
            239,
            973,
            1092,
            1104,
            1106,
        ]
    ]
    """
    Код региона: `1` - Москва и Московская область `2` - Санкт-Петербург `4` -
    Белгород `5` - Иваново `7` - Кострома `8` - Курск `9` - Липецк `10` - Орел
    `11` - Рязань `12` - Смоленск `13` - Тамбов `14` - Тверь `15` - Тула `16` -
    Ярославль `20` - Архангельск `21` - Вологда `22` - Калининград `23` - Мурманск
    `24` - Великий Новгород `25` - Псков `28` - Махачкала `30` - Нальчик `33` -
    Владикавказ `35` - Краснодар `36` - Ставрополь `37` - Астрахань `38` - Волгоград
    `39` - Ростов-на-Дону `41` - Йошкар-Ола `42` - Саранск `43` - Казань `45` -
    Чебоксары `47` - Нижний Новгород `48` - Оренбург `49` - Пенза `50` - Пермь
    `51` - Самара `53` - Курган `54` - Екатеринбург `56` - Челябинск `62` -
    Красноярск `63` - Иркутск `64` - Кемерово `65` - Новосибирск `66` - Омск `67` -
    Томск `75` - Владивосток `76` - Хабаровск `77` - Благовещенск `149` - Беларусь
    `159` - Казахстан `172` - Уфа `187` - Украина `191` - Брянск `192` - Владимир
    `193` - Воронеж `195` - Ульяновск `197` - Барнаул `213` - Москва `225` - Россия
    `239` - Сочи `973` - Сургут `1092` - Назрань `1104` - Черкесск `1106` - Грозный
    """
